<html>
	<head>
		<title>Lx-Office CRM AnwenderDokumentationLx-Office</title>
		<link rel="stylesheet" type="text/css" href="../css/main.css">
	</head>
<body>
<h2>AnwenderDokumentationLx-Office</h2>
<hr>
[<a name='Anfang und Anmelden' class='wikin'>Anfang und Anmelden</a>]<br>
<pre> 
</pre>Der Aufruf der CRM erfolgt durch die Eingabe von: http://localhost/lx-office-erp/login.pl in den Browser.<br>
<br>
Dann ist die Eingabemaske mit dem Benutzernamen und dem Passwort einzugeben, durch das Klicken auf den Button "Anmeldung" kommt man in die &Uuml;bersicht.<br>
<br>
Die &Uuml;bersicht nach der Anmeldung<br>
<br>
Unter dem Men&uuml; "Programm" kann man im Fenster "Benutzereinstellungen f&uuml;r ... " den Skin der ERP und CRM in dem Punkt "Men&uuml;setup" zwischen "new" und "old" w&auml;hlen. Dies ist Men&uuml;setup=old.<br>
<br>
<br>
<br>
Hier sollten bei der Erstanmeldung im Men&uuml; "Programm", "Benutzereinstellungen" die entsprechenden Felder ausgef&uuml;llt, die Datums.- und Zahlenformate eingestellt werden und mit dem Button "Speichern" das ganze sichern.<br>
<br>
[<a name='Schnellsuche' class='wikin'>Schnellsuche</a>]<br>
<br>
Ganz oben in der Men&uuml;leiste befindet sich ein Eingabefenster. Geben Sie hier einen Namen oder eine Telefonnummer ganz oder nur zu einem Teil ein, dann dr&uuml;cken Sie "Enter" oder klicken auf "suchen". Das Ergenis wird nun im Hauptfenster angezeigt. Die Schnellsuche kann mit Jokern arbeiten. Dabei gilt "?" und "_" f&uuml;r ein beliebiges Zeichen, "*" und "%" f&uuml;r beliebige Zeichenfolgen. Jede Suche wird automatisch um "%" erg&auml;nzt.<br>
<br>
Ein vorangehendes Jokerzeichen kann f&uuml;r jeden Benutzer fest eingestellt werden unter dem Men&uuml;punkt "CRM", "Benutzer", im Feld "PreSearch".<br>
<br>
<br>
[<a name='Kunden' class='wikin'>Kunden</a>]<br>
<br>
Da die CRM die gleiche Datenbankinstanz wie die ERP benutzt sind die Kundendaten identisch. Nur sind die Eingabemasken und die Suchfuntionen hier besser gelöst. Auch können beliebig viele Kontakte zu jedem Kunden gepflegt werden. Mit einem Klick auf [<a class='wikil' href='KundenSuche.html'>Kunde</a>] kommt man in die Suchmaske f&uuml;r Kunden. <br>
<br>
Mit einem Klick auf das Untermen&uuml; [<a class='wikil' href='KundeEingebenEditieren.html'>Kunde---erfassen</a>] kommt man in die Eingabemaske zum Eingeben der Kundendaten.<br>
<br>
[<a name='Lieferanten' class='wikin'>Lieferanten</a>]<br>
<br>
Mit einem Klick auf [<a class='wikil' href='Lieferantensuche.html'>Lieferant</a>] kommt man in die Suchmaske f&uuml;r Lieferanten.<br>
<br>
Mit einem Klick auf das Untermen&uuml; [<a class='wikil' href='LieferantenEingebenEditieren.html'>Lieferant---erfassen</a>] kommt man in die Eingabemaske zum Eingeben der Lieferantendaten.<br>
<br>
[<a name='Personen' class='wikin'>Personen</a>]<br>
<br>
Mit einem Klick auf [<a class='wikil' href='PersonenSuche.html'>Personen</a>] kommt man in die Suchmaske f&uuml;r Personen.<br>
<br>
Mit einem Klick auf das Untermen&uuml; [<a class='wikil' href='PersonenEingebenEditieren.html'>Personen---erfassen</a>] kommt man in die Eingabemaske zum Eingeben der Personendaten.<br>
<br>
[<a name='Wartungsvertrag' class='wikin'>Wartungsvertrag</a>]<br>
<br>
Mit einem Klick auf "Wartungsvertrag" kommt man in das Fenster "Wartungsvertr&auml;ge suchen". Es steht sofort die Suchmaske bereit. Es kann die Vertragsnummer oder eine Teilnummer eines Wartungsvertrages eingegeben werden. Z.B. 10 . Es werden alle Wartungsvertr&auml;ge die die Nummer 10 enthalten angezeigt. Wenn es nur einen mit der Teilnummer 10 gib wird dieser sofort in dem Fenster [<a class='wikil' href='WVEingebenEditieren.html'>Vertr&auml;ge eingeben/editieren</a>] angezeigt.<br>
<br>
Mit dem Untermen&uuml; "Wartungsvertrag---erfassen" kommt man in das Fenster [<a class='wikil' href='WVEingebenEditieren.html'>Wartungsvertr&auml;ge eingeben/editieren</a>].<br>
<br>
[<a name='Maschinen' class='wikin'>Maschinen</a>]<br>
<br>
Mit einem Klick auf "Maschinen" kommt man in die Suchmaske [<a class='wikil' href='MaschineInfoEdit.html'>Maschine info/edit</a>]. In ihr kann man einen Teil der Serien oder Artikelnummer eingeben und den Button "suchen" anklicken, dann werden der oder die Treffer zur Auswahl angezeigt. <br>
<br>
&Uuml;ber das Submen&uuml; "Maschienen---erfassen" kommt man in das Fenster [<a class='wikil' href='MaschinenEingebenEditieren.html'>Maschinen eingeben/editieren</a>].<br>
<br>
[<a name='Termine' class='wikin'>Termine</a>]<br>
<br>
Das Hauptfenster "Termine" ist in 3 Bereiche eingeteilt.<br>
<br>
Im ersten Bereich sind 3 Pulldownmen&uuml;s mit den Datumsanzeigen f&uuml;r den Tag, den Monat, das Jahr und 3 Buttons f&uuml;r "Tag", "Woche", "Monat" zusehen. Dazu gehört der Bereich des Kalenders (rechts) der entsprechend der Buttons in eine Tages-, Wochen oder Monatsansicht umschaltet. Man kann mit den Pulldownmen&uuml;s z.B. sofort das Jahr und den Monat festlegen und sich &uuml;ber den Button "Woche" die entsprechende Wochenansicht (in Abh&auml;ngigkeit vom Tag) anzeigen lassen.<br>
<br>
<br>
<br>
Der Bereich zum Eintragen von Terminen ist unterhalb bzw. links von den Kalederfunktionen. Klickt man auf den Button "K" in der ersten Zeile neben dem leeren Feld popt der entsprechende Monat des &uuml;berhalb eingestellten Monats und Jahres auf. Durch klicken auf einen Tag wird dieser eingetragen. -Oder durch direktes eingeben des Datums. Nun sollte man daneben noch die Uhrzeit und evtl. Wiederholungen eingeben.<br>
<br>
Der eingetragene Grund erscheint dann im Kalender und in der Verlaufsanzeige mit den Teilnehmern. &Uuml;ber den Button sichern wird der Termin gespeichert. Evtuelle &Uuml;berschneidungen angezeigt und gegebenfalls trotzdem "sichern".<br>
<br>
[<a name='Wiedervorlage' class='wikin'>Wiedervorlage</a>]<br>
<br>
Die Wiedervorlage ist eine Eingabemaske in der zu erledigende Vorg&auml;nge mit verschiedenen Dringlichkeiten bis zur Abarbeitung erinnern.<br>
<br>
Man kann &uuml;ber das Feld "CRM-User" die Wiedervorlage an einen Kollegen abgeben, und/oder &uuml;ber das Feld "Zugewiesen an" mit einer Person oder Firma verkn&uuml;pfen. Diese Vorlage erscheint als ein Eintrag in den Kundendaten oder Kontakten. &Uuml;ber den Button "Durchsuchen" kann man ein Dokument hochladen, das dann als Link darunter erscheint. In dem Feld "Dokumentenbeschreibung" kann man eine Gedankenst&uuml;tze dazu eingeben.<br>
<br>
Die Kontaktarten werden vor dem Betreff durch verschiedene Farben ausgedr&uuml;ckt. Die Zahl, in dem duch die "Kontaktart" farbig dargestelltem Feld, ist die "Priorit&auml;t". Die Farben der Kontaktart sind:<br>
<br>
gelb   =  Telefon<br>
<br>
gr&uuml;n   =  eMail<br>
<br>
blau   =  Fax/Brief<br>
<br>
lila   =  Persönlich<br>
<br>
rot    =  Datei<br>
<br>
Durch den Button "sichern" wird das Ganze gespeichert und erscheint in dem Fenster.<br>
<br>
Nach der Bearbeitung einfach die "Priorit&auml;t" auf "Erledigt" setzen und "sichern".<br>
<br>
[<a name='eMail versenden' class='wikin'>eMail versenden</a>]<br>
<br>
In diese Maske kommt man &uuml;ber das Men&uuml; "eMail" oder einem Maillink bei einer Adresse.<br>
<br>
In die Felder "An:" und "CC:" kann/können die Adresse/n direkt eingegeben werden. Die Mailadressen können auch &uuml;ber den  Button "suchen" , oder alle die die Buchstaben in dem Feld in der Mailadresse enthalten, angezeigt und &uuml;bernommen werden. Man kann auch Jockerzeichen, "_" f&uuml;r genau <strong>ein</strong> Zeichen und "%" f&uuml;r eine beliebige Zeichenfolge, mehrfach im Suchbegriff verwenden. Dabei ist die Reihenfolge zu beachten: Bei i%e mu&szlig; nicht das gleiche Ergebnis wie bei e%i erscheinen.<br>
<br>
Mit dem Versenden wird die Mail einem Kontakt zugeordnet, wenn es ihn gibt. Sie erscheint als neuer "Threat" in dem Verlauf des Kontaktes.<br>
<br>
[<a name='Dokumentenvorlage' class='wikin'>Dokumentenvorlage</a>]<br>
<br>
Wiederkehrende Dokumente mit standartisierten Inhalten als<br>
[<a class='wikil' href='Dokumentvorlagen.html'>Dokumentvorlagen</a>] erstellen und verwalten.<br>
<br>
[<a name='Etiketten' class='wikin'>Etiketten</a>]<br>
<br>
In der Maske Etiketten-Editor hat man die Möglichkeit die einem &uuml;berall begegnenden Etiketten zu erstellen. Dazu braucht man ersteinmal das Format, in dem die zubedruckenden Etiketten vorliegen. Dieses Format ist in den "Seitendefinitionen" unter "Seitengrö&szlig;e" einzustellen, dann kann man die Ma&szlig;einheiten einstellen. Unter den "Seitenr&auml;ndern" werden die gemessenen Ma&szlig;e vom Rand bis zum Etikett in der gew&auml;hlten Ma&szlig;einheit eingestellt. Unter "Abst&auml;nde" werden die Zwischenr&auml;ume der Etiketten in der Waagrechten (Spalten) und Senkrechten (Zeilen) Richtung eingetragen. Unter der "Grö&szlig;e der Aufkleber" ist die Etikettengrö&szlig;e einzugeben und unter der "Anzahl der Aufkleber" die Art der Best&uuml;ckung des Formats mit den Etiketten.<br>
<br>
Unter dem 3ten Bereich "Texte f&uuml;r Aufkleber" kann man vordefinierte Labels erstellen. Dazu sind eventuelle Leerzeilen f&uuml;r die &Uuml;bersichtlichkeit zu beachten. In dem Pulldown-men&uuml; unter "Fonts" kann die Grö&szlig;e der Schrift f&uuml;r jede Zeile eingestellt werden. Eine neue Zeile erzeugt man mit dem Button "mehr Textzeilen" unter dem Bereich "Aktionen". Mit dem Button "testen" kann das Ergebnis am Bildschirm angezeigt werden. F&uuml;r das automatische Erstellen mit den Kontaktdaten wird auf die Datenbank zugegriffen. Die gebr&auml;uchlisten Platzhalter hierf&uuml;r werden in den Bereichen sein:<br>
<br>
<pre> F&uuml;r Firmendaten:
 %ANREDE% (Firma) %NAME% (Firmenname) %NAME2% (Zusatzbezeichnung) %STRASSE%
 %PLZ% %ORT% %KONTAKT% (Name der Kontaktperson in der Firma)
</pre><br>
<br>
<pre> F&uuml;r Personendaten:
 %ANREDEPERS% (Anrede f. Person) %TITLE% (Titel) %NAMEPERS% (Name der Kontaktperson)
 %STRASSEPERS% (Stra&szlig;e der Person) %PLZPERS% (PLZ der Person) %ORTPERS% (Wohnort der Person)
</pre><br>
Nun kann man als Namen f&uuml;r das erstellte Label in dem Feld &uuml;ber "sichern als neu" z.B. Firma, Privat oder je nach Bedarf das Label speichern durch das klicken auf den Button "sichern als neu". Wird das Label verbessert oder umgestaltet den Button "sichern" verwenden. Die verschiedenen Labels können in dem Pulldown-men&uuml; ausgew&auml;hlt und &uuml;ber den Button "lade" angezeigt und bearbeitet werden.<br>
<br>
[<a name='Mitteilungen' class='wikin'>Mitteilungen</a>]<br>
<br>
Hier kann man Mitteilungen zu einer Firma einstellen, die in den Firmendaten mit ausgeben werden sollen.<br>
<br>
In dem ersten Feld kann man mit Platzhaltern ( _ f&uuml;r ein Zeichen und % f&uuml;r beliebige Zeichen) und Buchstaben nach der Firma suchen. Nach dem Ausw&auml;hlen der Firma kann man vorhandene Mitteilungen &uuml;ber den Button "holen" im Feld "eingestellte Mitteilungen:" anzeigen und dort bearbeiten bzw. löschen. Wichtig zum Anzeigen von schon eingestellten Meldungen ist das klicken auf den Button "suchen" und "&uuml;bernehmen", da bei der Browservervollst&auml;ndigung erst der Server dar&uuml;ber kontaktiert werden mu&szlig;.<br>
<br>
Wenn eine Firma durch "&uuml;bernehmen" ausgew&auml;hlt ist kann eine Mitteilung &uuml;ber sie eingestellt werden. Zu der Mitteilung kann eine Priorit&auml;t ausgew&auml;hlt werden. Die Priorit&auml;t "1" l&auml;&szlig;t die Mitteilung in einer roten blinkenden Schrift erscheinen. Die Priorit&auml;t "2" wird in schwarzer Schrift blinkend und die Priorit&auml;t "3" in schwarzer Schrift dargestellt. Es wird die wichtigste Priorit&auml;t angezeigt. Durch den Button "sichern" wird die Mitteilung gespeichert.<br>
<br>
[<a name='Benutzer' class='wikin'>Benutzer</a>]<br>
<br>
In dem Men&uuml; "Benutzer" kann der User seine eigenen Daten einpflegen. In diesen [<a class='wikil' href='BenutzerStammdaten.html'>Benutzer Stammdaten</a>] können z.B. der Vertreter oder das Mailfach bestimmt werden.<br>
<br>
[<a name='Gruppen' class='wikin'>Gruppen</a>]<br>
<br>
Hier können priviligierte User [<a class='wikil' href='Gruppen.html'>Gruppen</a>] anlegen, diesen Gruppen Usern zuordnen und wieder löschen.<br>
Mit den Gruppen können Berechtigungen auf Adressen vergeben werden.<br>
<br>
[<a name='Hilfe' class='wikin'>Hilfe</a>]<br>
<br>
Auf dieser Seite kann der User die verwendete Datenbank und die CRM-Version und den Server mit seinem login und seiner Nummer einsehen. Hier findet er den Link "Online-Hilfe" der zu dieser Hilfe f&uuml;hren soll.<br>

<hr>
Seiten die hierher zeigen [<a class='wikiw' href='ErgebnisLieferantensuche.html'>ErgebnisLieferantensuche</a>] [<a class='wikiw' href='PersonenEingebenEditieren.html'>PersonenEingebenEditieren</a>] [<a class='wikiw' href='ReparaturauftragEingebenEditieren.html'>ReparaturauftragEingebenEditieren</a>] [<a class='wikiw' href='ErgebnisKundensuche.html'>ErgebnisKundensuche</a>] [<a class='wikiw' href='Dokumentvorlagen.html'>Dokumentvorlagen</a>] [<a class='wikiw' href='ErgebnisPersonensuche.html'>ErgebnisPersonensuche</a>] [<a class='wikiw' href='Gruppen.html'>Gruppen</a>] 
</body>
</html>
