<html>
    <head>
        <title>Lx-Office CRM:  Termine</title>
        <link rel="stylesheet" type="text/css" href="../css/main.css">
    </head>
<body>
<a name="top"></a>
Das Hauptfenster &quot;Termine&quot; ist in 2 Bereiche eingeteilt:<br>
[<a href="#Eingabe">Eingabe eines Termin</a>] 
[<a href="#Anzeige">Anzeigen der Termine</a>]
<br>
<br>
<a name="Eingabe"><b>Eingeben und bearbeiten</a></b><br />
<hr>
Der erste, linke Bereich dient zum eintragen und bearbeiten von Terminen.<br /> 
Termine k&ouml;nnen f&uuml;r andere LxO-Benutzer angelegt werden. 
Bearbeiten oder gar l&ouml;schen von Terminen k&ouml;nnen nur die Besitzer der Termine oder der Benutzer der den Termin angelegt hat.<br />
<p>Klickt man auf eines der Kalendersymbole neben den leeren Feldern von/bis, 
popt ein Kallender mit dem aktuellen Monat auf. Tage mit Termin(en) 
sind mit einem blauen Punkt markiert.<br />
Durch klicken auf einen Tag wird dieser in das entsprechende Feld eingetragen.<br />
Nun sollte man daneben noch die Uhrzeit und evtl. Wiederholungen eingeben.</p>
<p>Der eingetragene Grund erscheint dann im Kalender und in der Wiedervorlage der Benutzers. <br />
Ein Termin kann als &quot;Privat&quot; markiert werden. Andere Benutzer bekommen dann den Grund nicht angezeigt, sondern einen Platzhalter.<br /> 
Zu jedem Termin k&ouml;nnen sie einen ausfr&uuml;hrlichen Text hinterlegen.</p>
<p>Darunter haben Sie die M&ouml;glichkeit, Teilnehmer einem Termin zuzuordnen. Ausgew&auml;hlte Teilnehmer/Gruppen stehen in der rechten Auswahlbox. In der linken Auswahlbox befinden siche alle Benutzer/Gruppen von Lx-Office. <br />
W&auml;hlen sie einen Namen in einer Box aus und entfernen &quot;Pfeil links&quot; Sie den Namen oder f&uuml;gen &quot;Pfeil rechts&quot; ihn hinzu.<br /> 
Wollen Sie einen Kunden oder Lieferanten zu einem Termin zuordnen, geben Sie einen Suchbegriff neben den Knopf "suche Teilnehmer" ein und klicken Sie auf den Knopf. Treffer werden in einem Popup-Fenster dargestellt. 
Selektieren Sie den Teilnehmer und klicken Sie auf <i>&Uuml;bernehmen</i>. Wiederholen Sie den Vorgang bis Sie fertig sind, dann schlie&szlig;en Sie das Fenster.</p>
&Uuml;ber den Button <i>sichern</i> wird der Termin gespeichert.<br />
Kommt es zu &Uuml;berschneidungen mit anderen Terminen, wird die Bearbeitungsmaske nicht gel&ouml;scht. Statt dessen werden die kollidierenden Termine angezeigt und oberhalb der Maske eine Checkbox mit der Sie den Eintrag erzwingen k&ouml;nnen wenn Sie noch einmal <i>sichern</i> anklicken.<br>
<br>
[<a href="#top">nach Oben</a>]
<br>
<a name="Anzeige"><b>Terminanzeige</b></a><br />
<hr>
<p>Im zweiten Bereich, rechts, sind 3 Pulldownmen&uuml;s f&uuml;r Tag, Monat und Jahr zusehen und der Button &quot;Zeigen&quot;. Dahinter befindet sich die Auswahlbox der LxO-Benutzer f&uuml;r den die Termine dargestellt werden sollen.<br />
Klicken Sie auf den Anzeigeknopf, wird die neue Ausgabe in der Tagesansicht aufgerufen.</p>
Jede Ansicht gibt das Datum der Anzeige aus und Pfeilkn&ouml;pfe um vor oder zur&uuml;ck zu bl&auml;ttern.<br /> 
<p>In der <b>Tagesansicht</b> k&ouml;nnen sie noch in die Wochenansicht oder Monatsdarstellung wechseln.<br />
Termine werden mit ihrer Kurzbezeichnung farblich ausgegeben. Blaue Termine betreffen den angemeldeten Benutzer. Rote Termine sind &ouml;ffentliche Termine anderer Benutzer. Gr&uuml;n sind private Termine anderer Benutzer. Die doppelten Striche unter einem Termin zeigen seinen eingestellten Bereich an. &Uuml;berschneidende Termine werden einger&uuml;ckt.<br />
Klicken Sie auf einen Termin, so wird ein neues Fenster ge&ouml;ffnet, in dem der Termin ausf&uuml;hrlich beschrieben wird. 
Haben sie die Berechtigung einen Termin zu bearbeiten, werden die entsprechenden Kn&ouml;pf angezeigt. Ein klick auf <i>&auml;ndern</i> l&auml;d den Datensatz in der Bearbeitungsmaske. </p>
<p>Befinden Sie sich in der <b>Wochenansicht</b> gibt es nur noch den Kopf f&uuml;r den Wechsel in die Monatsansicht. Um wieder in die Tagesansicht zuwechseln, klicken Sie in das farbig hinterlegte Tagesfeld.<br />
Feiertage und Wochenenden werden rot hinterlegt, alle anderen Tage sind grau.<br />
Termine werden mit Anfangszeit und Grund ausgegeben.</p>
<p>In der <b>Monatsansicht</b> k&ouml;nnen Sie mit einem Klick auf die Kalenderwoche in die Wochenansicht und mit einem Klick auf ein Datum in die Tagesansicht wechseln.<br />
Feiertage und Wochenenden werden rot hinterlegt, Tage die nicht zum Monat geh&ouml;ren sind hellgrau.<br />
Blaue Punkte zeigen Tage mit mindestens einen Termin.</p>
[<a href="#top">nach Oben</a>]
<center>[<a href="javascript:self.close();">Fenster schlie&szlig;en</a>]
</body>
</html>
